LESA-RPI/LESA_OccupancyUnit/STM32_WPAN/app/appli_mesh.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    appli_mesh.c
 * @author  MCD Application Team
 * @brief   User Application file 
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "ble_common.h"
#include "app_conf.h"
#include "hal_common.h"
#include "ble_mesh.h"
#include "appli_mesh.h"
#include "types.h"
#include "ble_hal_aci.h"
#include "ble_hci_le.h"
#include <string.h>
#include "models_if.h"
#include "mesh_cfg.h"
#include "generic.h"
#include "light.h"
#include "light_lc.h"
#include "sensors.h"
#include "common.h"
#include "serial_if.h"
#include "appli_nvm.h"
#include "pal_nvm.h"
#include "appli_config_client.h"
#include "appli_generic_client.h"
#include "appli_light_client.h"
#include "appli_sensor.h"
#include "appli_sensors_client.h"

#include "Tracking_Algo.h"
#include "app_tof.h"
#include "custom_ranging_sensor.h"
#include "TMD3725.h"
#include "TCS3430.h"

#include "stm32_seq.h"
#if (( CFG_LPM_SUPPORTED == 0) && (ENABLE_PWM_SUPPORT == 1))
#include "PWM_config.h"
#include "PWM_handlers.h"
#endif
#include "mesh_cfg_usr.h"

/** @addtogroup ST_BLE_Mesh
 *  @{
 */

/** @addtogroup Application_Mesh_Models
 *  @{
 */

/* Private define ------------------------------------------------------------*/
#define APPLI_OPTIM                     0

/*********** Macros to be modified according to the requirement *************/
#define BOUNCE_THRESHOLD                20U
#define LONG_PRESS_THRESHOLD            1000U
#define MANUAL_UNPROVISION_TIMER        3000U
#define FLASH_ERASE_TIME                100U
//#define DISCOVER_TIMER                  10*60*1000 /* 10 minutes */
#define DISCOVER_TIMER_INTERVAL         10*60*(1000000/CFG_TS_TICK_VAL)  /* 10 minutes */
#define LOOP_TIME_INTERVAL				(50000/CFG_TS_TICK_VAL) /*50ms*/
#if (APPLI_OPTIM == 1)
#define APPLI_MESH_TIMER_INTERVAL       1*(1000/CFG_TS_TICK_VAL)  /* 1 ms */
#endif
#define DEFAULT_DELAY_PACKET_FROM         500U
#define DEFAULT_DELAY_PACKET_RANDOM_TIME  500U
#define USER_OUTPUT_OOB_APPLI_PROCESS           0U
#define INPUT_OOB_TIMEOUT                       300U /* input Oob30 Sec timeout*/
#define PBADV_UNPROV_DEV_BEACON_INTERVAL        100U /* 100 ms */

#define DEVICE_KEY_SIZE                         16U
#define APP_KEY_SIZE                            16U
#if (LOW_POWER_FEATURE == 1)
#define LPN_API_TIMER_INTERVAL           5*(1000000/CFG_TS_TICK_VAL)  /* 5 secondes */
#endif
/* Private macro -------------------------------------------------------------*/
#define MAX_APPLI_BUFF_SIZE             8 
#define MAX_PENDING_PACKETS_QUE_SIZE    2
#define DATA_BUFFER_LENGTH              8
#define MAX_NUMB_ELEMENTS               APPLICATION_NUMBER_OF_ELEMENTS
#define CUSTOM_BEACON_AD_TYPE           0x00
#define ENABLE_CUSTOM_BEACON            0
#define CUSTOM_BEACON_INTERVAL          2000U

/**********************Friendship callbacks macros ****************************/
#define FN_CLEARED_REPEAT_REQUEST   1
#define FN_CLEARED_POLL_TIMEOUT     2
#define FN_CLEARED_FRIEND_CLEAR     3
#define LPN_CLEARED_NO_RESPONSE     1

/* Private variables ---------------------------------------------------------*/

enum ButtonState {
	BS_OFF, BS_DEBOUNCE, BS_SHORT_PRESS, BS_LONG_PRESS
};

enum ButtonState buttonState = BS_OFF;
tClockTime tBounce = 0;
/*Will be an array aligned with number of elements*/
MOBLEUINT8 Appli_LedState = 0;
MOBLEUINT16 IntensityValue = INTENSITY_LEVEL_ZERO;
MOBLEUINT8 IntensityFlag = FALSE;
MOBLEUINT8 ProxyFlag = 0;
MOBLEUINT8 ProvisionFlag = 0;
MOBLEUINT8 UnprovisionInProgress = 0;

MOBLEUINT8 Counter = 0;

#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
static MOBLEUINT8 PrvngInProcess = 0;
static MOBLEUINT32 OutputOobData = 0;
static MOBLEUINT32 OutputOobBlinkCount = 0;
#endif

#ifdef ENABLE_AUTH_TYPE_INPUT_OOB
MOBLEUINT8 InputOobData[8] = {0};
MOBLEUINT8 inputOOBDataReady = 0;
#endif

/*Number Of Elements selected per Node. Maximum Elements supported = 3*/
MOBLEUINT8 NumberOfElements = APPLICATION_NUMBER_OF_ELEMENTS;

#ifdef ENABLE_AUTH_TYPE_STATIC_OOB
/* 16 octets Static OOB information to be input here. Used during provisioning by Library */
const MOBLEUINT8 StaticOobBuff[SIZE_STATIC_OOB] = {0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                                                0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01};
#else
const MOBLEUINT8 StaticOobBuff[] = { 0 };
#endif

#ifdef PUB_KEY_TYPE_OOB
/* 64 octets Public Key information to be input here. It is only required for Public Key OOB case.
 Used during provisioning by Library */
const MOBLEUINT8 PubKeyBuff[64] = { 0xF4, 0x65, 0xE4, 0x3F, 0xF2, 0x3D, 0x3F,
		0x1B, 0x9D, 0xC7, 0xDF, 0xC0, 0x4D, 0xA8, 0x75, 0x81, 0x84, 0xDB, 0xC9,
		0x66, 0x20, 0x47, 0x96, 0xEC, 0xCF, 0x0D, 0x6C, 0xF5, 0xE1, 0x65, 0x00,
		0xCC, 0x02, 0x01, 0xD0, 0x48, 0xBC, 0xBB, 0xD8, 0x99, 0xEE, 0xEF, 0xC4,
		0x24, 0x16, 0x4E, 0x33, 0xC2, 0x01, 0xC2, 0xB0, 0x10, 0xCA, 0x6B, 0x4D,
		0x43, 0xA8, 0xA1, 0x55, 0xCA, 0xD8, 0xEC, 0xB2, 0x79 };

/* 32 octets Private Key information to be input here. It is only required for Public Key OOB case.
 Used during provisioning by Library */
const MOBLEUINT8 PrivKeyBuff[32] = { 0x52, 0x9A, 0xA0, 0x67, 0x0D, 0x72, 0xCD,
		0x64, 0x97, 0x50, 0x2E, 0xD4, 0x73, 0x50, 0x2B, 0x03, 0x7E, 0x88, 0x03,
		0xB5, 0xC6, 0x08, 0x29, 0xA5, 0xA3, 0xCA, 0xA2, 0x19, 0x50, 0x55, 0x30,
		0xBA };
#else
const MOBLEUINT8 PubKeyBuff[] = NULL;
const MOBLEUINT8 PrivKeyBuff[] = NULL;
#endif

/* Select Node as Sniffer, Means able to sniff all the packets 
 *  0 - Filters are enabled and packets not targeted to node are filtered
 *  1 - Filters are disabled and packets not targeted to node are not filtered
 */
MOBLEUINT8 DisableFilter = 0;

#if LOW_POWER_FEATURE
MOBLEINT32 BLEMesh_sleepTime;
MOBLEUINT32 SysRefCount;
MOBLEBOOL LPN_scan_enabled;
#endif

MOBLEUINT8 nvm_operation;
MOBLEUINT8 nvm_flash_page;
MOBLEUINT8 provisioning_completion;

/* Timer to control unprovisioned device beacons */
#if PB_ADV_SUPPORTED
MOBLEUINT8 discoverTimer_Id, discoverTimer_Id2;
tClockTime discoverTimerinterval = DISCOVER_TIMER_INTERVAL;
#endif

#if (APPLI_OPTIM == 1)
MOBLEUINT8 appliTaskTimer_Id;
#endif
#if LOW_POWER_FEATURE
volatile uint8_t BleProcessInit = 0;
#endif
#if (LOW_POWER_FEATURE == 1)
MOBLEUINT8 lowPowerNodeApiTimer_Id;
#endif

MOBLEUINT8 pPropertyId[4];

MOBLEUINT8 Sensor_Running = 0;

