LESA-RPI/LESA_OccupancyUnit/STM32_WPAN/app/appli_mesh.c
//color
static tcs3430_optics_val rawBaseColor, rawColor;
static tcs3430 sensor = { { 0 }, { 0 } };
static char Color[8];
//tof
static RANGING_SENSOR_Result_t rawBaseFrame, rawFrame;
static uint8_t BaseFrameValid = 0;



/********************* Application configuration **************************/
#if defined(__GNUC__) || defined(__IAR_SYSTEMS_ICC__) || defined(__CC_ARM)
MOBLEUINT8 bdaddr[8];

#ifdef INTERNAL_UNIQUE_NUMBER_MAC
static void Appli_GetMACfromUniqueNumber(void);
#endif /* INTERNAL_UNIQUE_NUMBER_MAC */

const void *mobleNvmBase;
const void *appNvmBase;
const void *prvsnr_data;
#else
#error "Unknown compiler"
#endif /* __GNUC__ || defined(__IAR_SYSTEMS_ICC__) || defined(__CC_ARM) */

/* Private function prototypes -----------------------------------------------*/
static void Appli_LongButtonPress(void);
static void Appli_ShortButtonPress(void);
static void Appli_LongButton2Press(void);
static void Appli_ShortButton2Press(void);
#if USER_OUTPUT_OOB_APPLI_PROCESS
void Appli_OobAuthenticationProcess(void);
#endif
void BLEMesh_UnprovisionCallback(MOBLEUINT8 reason);
void Appli_LowPowerProcess(void);
#if (APPLI_OPTIM == 1)
static void AppliMeshTask(void);
#endif
void Appli_GetPublicationParamsCb(model_publicationparams_t *pPubParameters);
WEAK_FUNCTION(
		void SerialPrvn_ProvisioningStatusUpdateCb(uint8_t flagPrvningInProcess, MOBLEUINT16 nodeAddress));

/* Private functions ---------------------------------------------------------*/

/************************* Button Control functions ********************/
/**
 * @brief  Function calls when a button is pressed for short duration  
 * @param  void
 * @retval void
 */

static void Appli_ShortButtonPress(void) {
	/* CIE color PID */
	pPropertyId[0] = 0x1D;    // Property ID byte 0 : Property ID for the sensor
	pPropertyId[1] = 0x00;    // Property ID byte 1 : Property ID for the sensor
	//MESH_MODEL_SENSOR_APP_CODE: Begin
#if ENABLE_SENSOR_MODEL_CLIENT==1
	TRACE_M(TF_SENSOR,"\n\rClient Short Button Pressed\r\n");
	/* Sensor Client Send SENSOR_GET request with PRESENT_AMBIENT_TEMPERATURE_PID */
	Appli_SensorsClient_API(0, SENSOR_GET, pPropertyId);
	#elif ENABLE_SENSOR_MODEL_SERVER==1
	TRACE_M(TF_SENSOR, "\n\rServer Short Button Pressed\r\n");
//length 2, peer 0004, dst 0003, element index 0
	Sensor_Get(pPropertyId, 2, 0xc000, 0xc000, 0);//TODO: change the master address dynamically
	/*__weak MOBLE_RESULT Sensor_Get(const MOBLEUINT8* pGetParam,
	 MOBLEUINT32 length,
	 MOBLE_ADDRESS peerAddr,
	 MOBLE_ADDRESS dstPeer,
	 MOBLEUINT8 elementIndex)*/
#endif
	//MESH_MODEL_SENSOR_APP_CODE: End
}

/**
 * @brief  Function calls when a button is pressed for Long duration  
 * @param  void
 * @retval void
 */
static void Appli_LongButtonPress(void) {
	/* TIME_OF_FLIGHT_PID */
	pPropertyId[0] = 0x7F;    // Property ID byte 0 : Property ID for the sensor
	pPropertyId[1] = 0x2A;    // Property ID byte 1 : Property ID for the sensor
#if ENABLE_SENSOR_MODEL_CLIENT==1
	TRACE_M(TF_SENSOR,"\n\rClient Long Button Pressed\r\n");
	/* Sensor Client Send SENSOR_GET request with TIME_OF_FLIGHT_PID */
	Appli_SensorsClient_API(0, SENSOR_GET, pPropertyId);
	#elif ENABLE_SENSOR_MODEL_SERVER==1
	TRACE_M(TF_SENSOR, "\n\rServer Long Button Pressed\r\n");
	//length 2, peer 0004, dst 0003, element index 0
	MX_TOF_Begin();
	Sensor_Get(pPropertyId, 2, 0xc000, 0xc000, 0); //TODO: change the master address dynamically
	MX_TOF_Stop();

#endif
}
/**
 * @brief  Function calls when a button2 is pressed for short duration
 * @param  void
 * @retval void
 */
static void Appli_ShortButton2Press(void) {

	if (Sensor_Running) {
		HW_TS_Stop(discoverTimer_Id2);
		MX_TOF_Stop();
		Sensor_Running = 0;
	} else {
		MX_TOF_Begin();
		HW_TS_Start(discoverTimer_Id2, LOOP_TIME_INTERVAL);
		Sensor_Running = 1;
	}

}
/**
 * @brief  Function calls when a button2 is pressed for Long duration
 * @param  void
 * @retval void
 */
static void Appli_LongButton2Press(void) {
	//Enable detection

	MX_TOF_Begin();
	//change formate to fit STM_DataPacket.c

	//get sensor values
	CUSTOM_RANGING_SENSOR_GetDistance(CUSTOM_VL53L8CX, &rawBaseFrame);
	rawBaseColor = get_raw_XYZ(&sensor);

	printf("base value being set\n\r");

	MX_TOF_Stop();
	BaseFrameValid = 1;

	Update_ALSThreshold(&sensor);


}

/**
 * @brief  Updates the button status  
 * @param  int isPressed
 * @retval void
 */
static void Appli_UpdateButtonState(int isPressed) {
	uint32_t t0 = 0, t1 = 1;

	t0 = Clock_Time(); /* press timing */

	while (BSP_PB_GetState(BUTTON_SW1) == BUTTON_PRESSED)
		;
	t1 = Clock_Time(); /* SW1 release timing */

	if ((t1 - t0) > LONG_PRESS_THRESHOLD) {
		Appli_LongButtonPress();
	} else if ((t1 - t0) > BOUNCE_THRESHOLD) {
		/* Button 1 short press action */
		Appli_ShortButtonPress();
	}
}
static void Appli_UpdateButton2State(int isPressed) {
	BSP_LED_Toggle(LED_BLUE);

	uint32_t t0 = 0, t1 = 1;

	t0 = Clock_Time(); /* press timing */
	while (BSP_PB_GetState(BUTTON_SW2) == BUTTON_PRESSED)
		;	//TODO: fill out this
	t1 = Clock_Time(); /* SW2 release timing */

	if ((t1 - t0) > LONG_PRESS_THRESHOLD) {
		Appli_LongButton2Press();
	} else if ((t1 - t0) > BOUNCE_THRESHOLD) {
		Appli_ShortButton2Press();

	}
}

static void beginTracking(){
	//TODO: this function is called when an interrupt happened
	/* Tasks:
	 * 1 check for the existance of base frame
	 * 2 remove self clear color interrupt register
	 * 3 while (20frames) read from the color register and tof, constantly ranging until no more **
	 * 4 sets up the interrupt register again
	 *
	 */
	//task 1
	printf("begin Tracking triggered\n\r");
	BSP_LED_On(LED_GREEN);

	if (BaseFrameValid==0){
		printf("BaseFrame uninitialized");
		return;
	}
	//task 2
	set_ALSInterrupt(sensor.reginfo, 0, 0);
	reset_Status(sensor.reginfo);


	//task 3

	//Creates 2D arrays to hold the normalized data
	int BaseFrame[8][8];
	int Frame[8][8];
	int NormFrame[8][8];
	MX_TOF_Begin();

	parse_TOF_result(&rawBaseFrame, BaseFrame);
	FIFObuffer fifobuffer;
	init_fifo(&fifobuffer); // Initialize the FIFObuffer

	printf("\033[2J\033[H");
	uint8_t loopblob = 40;
	while (loopblob!=0) {
		//reads new frame
#if (1)
		printf("\033[H");
		//printf("\033[2J\033[H");
#endif
		printf("%d loop til sleep\n\r",--loopblob);
		printf("NEWFRAME\n\r");
		int32_t status = CUSTOM_RANGING_SENSOR_GetDistance(CUSTOM_VL53L8CX,
				&rawFrame);
		while (status != 0) {
			status = CUSTOM_RANGING_SENSOR_GetDistance(CUSTOM_VL53L8CX,
					&rawFrame);
		}
		rawColor = get_raw_XYZ(&sensor);
		//TCS3430_print_color(&rawColor);
		float dx, dy;
		colordiff(rawBaseColor,rawColor,&dx,&dy);


		//parse new frame
		parse_TOF_result(&rawFrame, Frame);

		subtract_matrices(NormFrame, BaseFrame, Frame); //norm_data=8 by 8 matrix

//TODO: decide whether print matrix or not
		print_matrix(NormFrame);


