LESA-RPI/LESA_OccupancyUnit/STM32_WPAN/app/appli_mesh.c
        FrameInfo frame_info = parse_frame(NormFrame,dx,dy);

        //print_frame_info(frame_info);

        if (frame_info.num_blobs>0){loopblob=40;}

        enqueue(&fifobuffer, frame_info); // Store the FrameInfo into the FIFObuffer
        //print_frame_info(fifobuffer.buffer[fifobuffer.rear]);

        print_frame_info_simple(fifobuffer.buffer[fifobuffer.rear]);
        printf("NEWFRAMEEND\n\r");


        //printf( "About to print FIFO\n\r");
        //print_fifo(&fifobuffer);


/*
        printf( "\n\r************************************************************"
                "\n\r************************************************************\033[H\033[H\033[H");//*/

        printf("\033[H");
	}

	//task 4
	Update_ALSThreshold(sensor.reginfo);
	reset_Status(sensor.reginfo);
	MX_TOF_Stop();
	BSP_LED_Off(LED_GREEN);
	set_ALSInterrupt(sensor.reginfo, 1, 0);
}

/**
 * @brief  task for the BLE MESH, the MESH Models and the Appli processes  
 * @param  void
 * @retval void
 */
static void Mesh_Task() {
	BLEMesh_Process();
	BLEMesh_ModelsProcess(); /* Models Processing */

	if ((UnprovisionInProgress > 0)
			&& (!LL_FLASH_IsActiveFlag_OperationSuspended())) {
		UnprovisionInProgress = 0;
		AppliNvm_ClearModelState();
		PalNvmErase(PRVN_NVM_BASE_OFFSET, 4);
		TRACE_M(TF_PROVISION, "NVM erased\r\n");
		TRACE_M(TF_PROVISION, "Device is unprovisioned by application \r\n");
	}

#if (APPLI_OPTIM == 0)
	/* Set the task in the scheduler for the next execution */
#if (LOW_POWER_FEATURE == 0)
	UTIL_SEQ_SetTask(1 << CFG_TASK_MESH_REQ_ID, CFG_SCH_PRIO_0);
#endif
#endif
}

/**
 * @brief  task for the BLE MESH, the MESH Models and the Appli processes  
 * @param  void
 * @retval void
 */
static void Appli_Task() {
	Appli_Process();

#if (APPLI_OPTIM == 0)
	/* Set the task in the scheduler for the next execution */
#if (LOW_POWER_FEATURE == 0)
	UTIL_SEQ_SetTask(1 << CFG_TASK_APPLI_REQ_ID, CFG_SCH_PRIO_0);
#endif
#endif
}

/************************* LED Control functions ********************/
/**
 * @brief  Controls the state of on board LED
 * @param  void
 * @retval void
 */
void Appli_LedCtrl(void) {
	if (Appli_LedState) {
		BSP_LED_On(LED_BLUE);

	} else {
		BSP_LED_Off(LED_BLUE);

	}
}

/************* BLE-Mesh library callback functions ***************/

/**
 * @brief  Blinks the on board LED  
 * @param  none
 * @retval MOBLE_RESULT status of result
 */
MOBLE_RESULT Appli_LedBlink(void) {
	/* Switch On the LED */
	Appli_LedState = 1;
	Appli_LedCtrl();
	Clock_Wait(500);

	/* Switch Off the LED */
	Appli_LedState = 0;
	Appli_LedCtrl();
	Clock_Wait(500);

	return MOBLE_RESULT_SUCCESS;
}

/**
 * @brief  Callback function Sets the state of the bulb 
 * @param  MOBLEUINT16 ctrl which sets the lighting state of LED
 * @retval MOBLE_RESULT status of result
 */
MOBLE_RESULT Appli_LedStateCtrlCb(MOBLEUINT16 ctrl) {
	/* Switch On the LED */
	if (ctrl > 0) {
		Appli_LedState = 1;
	}
	/* Switch Off the LED */
	else {
		Appli_LedState = 0;
	}

	Appli_LedCtrl();

	return MOBLE_RESULT_SUCCESS;
}

/**
 * @brief  initializes BLE Stack    
 * @param  none
 * @retval MOBLE_RESULT status of result
 */
MOBLE_RESULT Appli_BleStackInitCb() {
	/* BLE Stack initialization */
	/* Not Required in BLE */
	return MOBLE_RESULT_SUCCESS;
}

/**
 * @brief  Sets transmission power of RF 
 * @param  none
 * @retval MOBLE_RESULT status of result
 */
MOBLE_RESULT Appli_BleSetTxPowerCb(void) {
	tBleStatus status;
	/* API to change the Transmission power of BLE Device */
	/* uint8_t en_high_power, uint8_t pa_level
	 en_high_power Can be only 0 or 1. Set high power bit on or off.
	 pa_level Can be from 0 to 7. Set the PA level value
	 */
	status = aci_hal_set_tx_power_level(1, CFG_TX_POWER);
	if (status)
		return MOBLE_RESULT_FAIL;
	else
		return MOBLE_RESULT_SUCCESS;
}

/**
 * @brief  SET UUID value 
 * @param  uuid_prefix_data : Pointer of UUID buffer data
 * @retval MOBLE_RESULT status of result
 */
MOBLE_RESULT Appli_BleSetUUIDCb(MOBLEUINT8 *uuid_prefix_data) {
	/* UUID is 128 bits (16 bytes) and can guarantee uniqueness across space and time.
	 It can be "Time-based" UUID or "truly-random or pseudo-random numbers"
	 
	 In this buffer user need to fill 10 bytes of UUID data. 
	 Remaining 6 bytes, library fill this data with BDaddress.

	 For example :
	 F81D4FAE-7DEC-XBC4-Y12F-17D1AD07A961 (16 bytes)
	 <any number> |_|  |_|   <BDAddress>

	 X = 1 i.e. "Time Base UUID"
	 X = 4 i.e. "Random Number"
	 Y = 4 i.e. Conforming to the current spec 
	 For UUID information refer RFC4122
	 */

	/* copy UUID prefix data*/
	uint8_t uuid_buff[10] = { 0xF8, 0x1D, 0x4F, 0xAE, 0x7D, 0xEC };/*random value by user */

	uuid_buff[6] = 0x4B; /* 0x4B => 4 : Random */
	uuid_buff[7] = 'S'; /* User define value */
	uuid_buff[8] = 0xA1; /* 0xA1 => A : Conforming to the current Spec */
	uuid_buff[9] = 'T'; /* User define value */

	memcpy(uuid_prefix_data, uuid_buff, sizeof(uuid_buff));
	memcpy(&uuid_prefix_data[10], bdaddr, 6); /* Copy bdaddr to last 6 bytes of UUID */

	return MOBLE_RESULT_SUCCESS;
}

/**
 * @brief  SET CID , PID and VID values 
 * @param  company_product_info : vendor fill product information in this buffer
 * @retval MOBLE_RESULT status of result
 */
MOBLE_RESULT Appli_BleSetProductInfoCB(MOBLEUINT8 *company_product_info) {
	/* CID : provide 16-bit company identifier assigned by the Bluetooth SIG */
	uint16_t company_id = COMPANY_ID;

	/* PID : Provide 16-bit vendor-assigned product identifier */
	uint16_t product_id = PRODUCT_ID;

	/* VID : Provide 16-bit vendor-assigned product version identifier*/
	uint16_t product_version_id = PRODUCT_VERSION_ID;

	memcpy(company_product_info + 0, (void*) &company_id, sizeof(company_id));
	memcpy(company_product_info + 2, (void*) &product_id, sizeof(product_id));
	memcpy(company_product_info + 4, (void*) &product_version_id,
			sizeof(product_version_id));

	return MOBLE_RESULT_SUCCESS;
}

/**
 * @brief  Call back function called when GATT Connection Created  
 * @param  none
 * @retval none
 */
void Appli_BleGattConnectionCompleteCb(void) {
	ProvisionFlag = 1;
	/* Proxy Node, will be called whenever Gatt connection is established */
	/* Turn ON Red LED*/
	ProxyFlag = 1;
	BSP_LED_On(LED_GREEN);
}

/**
 * @brief  Call back function called when GATT Disconnection Complete  
 * @param  none
 * @retval none
 */
void Appli_BleGattDisconnectionCompleteCb(void) {
	ProvisionFlag = 0;
	/* Proxy Node, will be called whenever Gatt disconnected */
	/* Turn Off Red LED*/
	ProxyFlag = 0;
	BSP_LED_Off(LED_GREEN);
}

/**
 * @brief Unprovisioned Node Identification
 * @param MOBLEUINT8 data 
 * @retval none
 */
void Appli_BleUnprovisionedIdentifyCb(MOBLEUINT8 data) {
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  PrvngInProcess = 1;  
#endif   
	TRACE_M(TF_PROVISION, "Unprovisioned Node Identifier received: %02x\n\r",
			data);
}

/**
 * @brief  Set Number of Elements in a Node
 * @param  none
 * @retval Sending the value to BLE Mesh Library
 */
MOBLEUINT8 Appli_BleSetNumberOfElementsCb(void) {
	if (NumberOfElements > BLEMesh_GetNumberOfElements()) {
		TRACE_M(TF_MISC,
				"Number of Elements enabled in application exceeding from Library Capability!\r\n");
		return BLEMesh_GetNumberOfElements();
	}

	else if (NumberOfElements == 0) {
		TRACE_M(TF_MISC, "Number Of Elements must be 1 or greater than 1!\r\n");
		return 1;
	}

	else {
		return NumberOfElements;
	}
}

/**
 * @brief  Sets the Attention Timer Callback function
 * @param  none
 * @retval MOBLE_RESULT status of result
 */
MOBLE_RESULT Appli_BleAttentionTimerCb(void) {
	/* avoid printf, if low power feature is supported */
#if (LOW_POWER_FEATURE == 0)
	TRACE_M(TF_MISC, " \r\n");
#endif /* LOW_POWER_FEATURE == 0 */
	return MOBLE_RESULT_SUCCESS;
}

/**
 * @brief  Call back function to give Output OOB information 
 * @param  MOBLEUINT8* output_oob
 * @param  MOBLEUINT8 size
 * @retval void
 */
void Appli_BleOutputOOBAuthCb(MOBLEUINT8 *output_oob, MOBLEUINT8 size) {
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  uint32_t ooBData = 0;    
    for (MOBLEUINT8 i = 0; i < size; i++)
    {
        ooBData |= (output_oob[i] << 8*i);
    }
    OutputOobData = ooBData;
    TRACE_M(TF_PROVISION,"Output OOB information for provisioner: %ld\n\r", ooBData);
  #endif
}

