LESA-RPI/LESA_OccupancyUnit/STM32_WPAN/app/appli_mesh.c
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
/**
* @brief  Process for both output and Input OOB handling
* @param  void
* @retval void
*/ 
void Appli_OobAuthenticationProcess(void)
{
    if(OutputOobBlinkCount < OutputOobData)
    {
      OutputOobBlinkCount++;
      Appli_LedBlink();
    }
    else
    {
        OutputOobBlinkCount++;
        Clock_Wait(1000);
        if(OutputOobBlinkCount > OutputOobData+3)
        {
            OutputOobBlinkCount = 0;
        }
    }
}
#endif

/**
 * @brief  Call back function to provide Input OOB information
 * @param  MOBLEUINT8 size
 * @retval MOBLEUINT8*  
 */
MOBLEUINT8* Appli_BleInputOOBAuthCb(MOBLEUINT8 size) {
#if defined (ENABLE_AUTH_TYPE_INPUT_OOB) && (ENABLE_SERIAL_INTERFACE)
  MOBLEUINT16 inputTimer = 0; 
  TRACE_M(TF_PROVISION,"Input OOB information for provisioner-Size: %d\n\r", size);   
  while(1)
  {
      Serial_InterfaceProcess();
      /* Enable Mesh process working in while loop */
      BTLE_StackTick();
      /* Check if input is completed or timeout */
      if((inputOOBDataReady != 0x00) | (inputTimer > INPUT_OOB_TIMEOUT))
      {
          inputOOBDataReady = 0;
          break;
      }
      Clock_Wait(100);
      inputTimer++;
  }
  return InputOobData; 
#else
	return NULL;
#endif
}

/**
 * @brief  Call back function to provide Input OOB information
 * @param  rcvdStringBuff: buffer to store input string 
 * @param  rcvdStringSize: length of the input string 
 * @retval void  
 */
void Appli_BleSerialInputOOBValue(char *rcvdStringBuff, uint16_t rcvdStringSize) {
#ifdef  ENABLE_AUTH_TYPE_INPUT_OOB
  unsigned long long InputOobDatatemp;
    sscanf(rcvdStringBuff + 5, "%lld", &InputOobDatatemp);
    memmove(&InputOobData, &InputOobDatatemp, sizeof(InputOobDatatemp));
    inputOOBDataReady = 1;
#endif
}

/**
 * @brief  Application BLE Disable Filter 
 * @param  none
 * @retval Status is replied
 */
MOBLEUINT8 Appli_BleDisableFilterCb(void) {
	return DisableFilter;
}

/**
 * @brief  Checks and do Manual Unprovision of board  
 * @param  void
 * @retval void
 */
void Appli_CheckForUnprovision(void) {
	/* Checks if the User button is pressed or not at the startup */
	if (BSP_PB_GetState(BUTTON_SW1) == BUTTON_PRESSED) {
		BSP_LED_On(LED_BLUE);
		tClockTime t = Clock_Time();
		int interrupted = 0;

		/*Wait to check if user is pressing the button persistently*/
		while ((Clock_Time() - t) < MANUAL_UNPROVISION_TIMER) {
			if (BSP_PB_GetState(BUTTON_SW1) != BUTTON_PRESSED) {
				interrupted = 1;
				break;
			}
		}
		/* Unprovision, show that unprovisioning is completed, and 
		 wait until user releases button*/
		if (!interrupted) {
			/* No GATT connection */
			BLEMesh_StopAdvScan();
			HAL_Delay(10);

			PalNvmErase(PRVN_NVM_BASE_OFFSET, 4);
			TRACE_M(TF_PROVISION, "NVM erased\r\n");

			BLEMesh_Unprovision();
			AppliNvm_ClearModelState();
			TRACE_M(TF_PROVISION,
					"Device is unprovisioned by application \r\n");
			t = Clock_Time();
			while ((Clock_Time() - t) < FLASH_ERASE_TIME) {
				BLEMesh_Process();
			}

			while (BSP_PB_GetState(BUTTON_SW1) == BUTTON_PRESSED) {
				Appli_LedBlink();
			}
		}
		BSP_LED_Off(LED_BLUE);
	}

	/* Register the task for all MESH dedicated processes */
	UTIL_SEQ_RegTask(1 << CFG_TASK_MESH_REQ_ID, UTIL_SEQ_RFU, Mesh_Task);
	/* Set the task in the scheduler for the next scheduling */
#if (LOW_POWER_FEATURE == 0)
	UTIL_SEQ_SetTask(1 << CFG_TASK_MESH_REQ_ID, CFG_SCH_PRIO_0);
#else
  BleProcessInit = 1;
#endif

	/* Register the task for all MESH dedicated processes */
	UTIL_SEQ_RegTask(1 << CFG_TASK_APPLI_REQ_ID, UTIL_SEQ_RFU, Appli_Task);
	/* Set the task in the scheduler for the next scheduling */
#if (LOW_POWER_FEATURE == 0)
	UTIL_SEQ_SetTask(1 << CFG_TASK_APPLI_REQ_ID, CFG_SCH_PRIO_0);
#endif  

#if (APPLI_OPTIM == 1)
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &appliTaskTimer_Id, hw_ts_Repeated, AppliMeshTask);
  
  HW_TS_Start(appliTaskTimer_Id, APPLI_MESH_TIMER_INTERVAL);
#endif
}

void Appli_Unprovision(void) {
	if (!ProxyFlag) {
		/* No GATT connection */
		BLEMesh_StopAdvScan();
		HAL_Delay(10);

		PalNvmErase(PRVN_NVM_BASE_OFFSET, 4);
		TRACE_M(TF_PROVISION, "NVM erased\r\n");

		BLEMesh_Unprovision();
		AppliNvm_ClearModelState();
		TRACE_M(TF_PROVISION, "Device is unprovisioned by application \r\n");

		BLEMesh_Process();
		NVIC_SystemReset();
	}
}

/**
 * @brief  Checks and updates Mac address to generate MAC Address
 * @param  void
 * @retval MOBLEUINT8 sum return the sum calculated mac
 */
int Appli_CheckBdMacAddr(void) {
	MOBLEUINT8 sum = 239;
	MOBLEUINT8 result = 0;
	tBleStatus status = BLE_STATUS_SUCCESS;

#ifdef EXTERNAL_MAC_ADDR_MGMT
  memcpy(bdaddr, (MOBLEUINT8 *)CFG_ADV_BD_ADDRESS, 7);
  bdaddr[7] = (EXTERNAL_MAC_ADDR_MGMT | EXTERNAL_MAC_TYPE);
#endif

#ifdef INTERNAL_UNIQUE_NUMBER_MAC
	status = aci_hal_read_config_data(CONFIG_DATA_PUBADDR_OFFSET, &bdaddr[7],
			bdaddr);
	if (status != BLE_STATUS_SUCCESS) {
		TRACE_M(TF_PROVISION, "Failed to read Public Address %d", status);
	}

	Appli_GetMACfromUniqueNumber();
	bdaddr[7] = INTERNAL_UNIQUE_NUMBER_MAC;
#endif

	for (int i = 0; i < 6; ++i) {
		sum = (sum << 1) + bdaddr[i];
	}

	if (sum == bdaddr[6]) {
		result = 1;
	}

#if defined(EXTERNAL_MAC_ADDR_MGMT) && defined(EXTERNAL_MAC_IS_PUBLIC_ADDR)
   /* Do nothing for modification of 2 MSb */
#else
	bdaddr[5] |= 0xC0; /* 2 Msb bits shall be 11b for Static Random Address */
#endif

#ifdef GENERATE_STATIC_RANDOM_MAC
  /* 6bytes of MAC will be filled, baddr_tmp[7] will contain the length  */
  status = aci_hal_read_config_data(CONFIG_DATA_RANDOM_ADDRESS_OFFSET, 
                                    &bdaddr[7], 
                                    bdaddr); 
  if(status != BLE_STATUS_SUCCESS) 
  {
    TRACE_M(TF_PROVISION, "Failed to read Random Address %d", status);
  }

  bdaddr[7] = GENERATE_STATIC_RANDOM_MAC;   
                      /* Do nothing for bdaddr, just pass the identification */
  result = 1;         /* This will overwrite the above for loop result, 
                          which is redundant for this case */
#endif  

	return result;
}

/**
 * @brief  Reads the unique serial number of the device
 * @param  void
 * @retval void
 */
#ifdef INTERNAL_UNIQUE_NUMBER_MAC
static void Appli_GetMACfromUniqueNumber(void) {
#ifdef STM32L152xE
  /************************STM32L152RE 96 bit Unique ID addresses***************/
#define DEVICE_ID_REG0 (0x1FF800D0)
#define DEVICE_ID_REG1 (0x1FF800D4)
#define DEVICE_ID_REG2 (0x1FF800E4)
#endif

