LESA-RPI/LESA_OccupancyUnit/STM32_WPAN/app/appli_mesh.c
	/*
	 The unique serial number is a six bytes value generated from STM32 UID 
	 stored at DEVICE_ID_REG0, DEVICE_ID_REG1 and DEVICE_ID_REG2. It is generated 
	 cancating 4bytes from DEVICE_ID_REG2 and first bytes of DEVICE_ID_REG0 and 
	 DEVICE_ID_REG1. Since the UID at DEVICE_ID_REG0 and 
	 DEVICE_ID_REG1 could be identical for same batch samples, 
	 4 bytes have been taken from DEVICE_ID_REG2
	 */

	uint8_t i;
	uint8_t sum = 239;
#if 0
  uint8_t *ls_addr;
  
  ls_addr = (uint8_t*)DEVICE_ID_REG2;
  
  for(i = 0; i < 4; i += 1) 
  {
    bdaddr[i] = *ls_addr;
    ls_addr++;
  }
  
  bdaddr[4] = *(uint8_t*)(DEVICE_ID_REG0);
  bdaddr[5] = (*(uint8_t*)(DEVICE_ID_REG1)) | 0xC0; 
#endif
	/* Static Device Address: 
	 The two most significant bits 
	 of the address shall be equal to 1, 
	 hence ORed with 0xC0)*/

	for (i = 0; i < 6; ++i) {
		sum = (sum << 1) + bdaddr[i];
	}
	bdaddr[6] = sum;
}
#endif

#if 0 
/**
* @brief  provides the information of the power saving mode
* @param  sleepMode currently unused, to be used in future 
* @retval SleepModes returns the mode of the controller
*/
SleepModes App_SleepMode_Check(SleepModes sleepMode)
{
  if (buttonState == BS_OFF)
  {
    return SLEEPMODE_WAKETIMER;
  }
  else
  {
    return SLEEPMODE_RUNNING;
  }
}
#endif

/**
 * @brief  callback for unprovision the node by provisioner.
 * @param  status reserved for future 
 * @retval void
 */
void BLEMesh_UnprovisionCallback(MOBLEUINT8 reason) {
	ProvisionFlag = 0;

	TRACE_I(TF_PROVISION, "Device is unprovisioned by provisioner \n\r");
#if PB_ADV_SUPPORTED
	BLEMesh_SetUnprovisionedDevBeaconInterval(PBADV_UNPROV_DEV_BEACON_INTERVAL);
#endif
	BLEMesh_StopAdvScan();
	HAL_Delay(10);

	PalNvmErase(PRVN_NVM_BASE_OFFSET, 4);
	TRACE_M(TF_PROVISION, "NVM erased\r\n");

	BLEMesh_Unprovision();
	AppliNvm_ClearModelState();
	TRACE_M(TF_PROVISION, "Device is unprovisioned by application \r\n");

	NVIC_SystemReset();
}

/**
 * @brief  This function scans and prints unprovisioned devices  
 * @param  unprovDeviceArray: Pointer of an array for filling unprovisioned device UUIDs
 * @param  noOfUnprovDevices: Pointer to take total count of nearby unprovisioned devices
 * @retval MOBLE_RESULT
 */
MOBLE_RESULT BLEMesh_ScanDevices(neighbor_params_t *unprovDeviceArray,
		MOBLEUINT8 *noOfUnprovDevices) {
	MOBLE_RESULT result;

	result = BLEMesh_GetNeighborState(unprovDeviceArray, noOfUnprovDevices);
	/* Array print for testing */
	/* Check if any unprovisioned device is available */
	if (!(*noOfUnprovDevices)) {
		TRACE_I(TF_PROVISION, "No Unprovisioned Device Nearby\r\n");
	} else {
		for (MOBLEINT8 count = 0; count < *noOfUnprovDevices; count++) {
			BLEMesh_PrintStringCb("");
			TRACE_I(TF_PROVISION, "Device-%d -> ", count);
			BLEMesh_PrintDataCb(unprovDeviceArray[count].uuid, 16);
		}
	}
	return result;
}
/**
 * @brief  This function returns starts the provisioning of one of the devices
 * @param  unprovDeviceArray: Pointer of an array having unprovisioned device UUIDs
 * @param  index: Index of the device to be provisioned
 * @retval MOBLE_RESULT
 */
MOBLE_RESULT BLEMesh_ProvisionDevice(neighbor_params_t *unprovDeviceArray,
		MOBLEUINT16 index) {
	MOBLE_RESULT result = MOBLE_RESULT_SUCCESS;

	result = BLEMesh_ProvisionRemote((unprovDeviceArray + index)->uuid);

	return result;
}

/* Customized implementation for provisioning a device from mesh node - End */

/**
 * @brief  Call back function called when PB-ADV link Opened  
 * @param  none
 * @retval none
 */
void BLEMesh_PbAdvLinkOpenCb(void) {
	ProvisionFlag = 0;
	TRACE_M(TF_PROVISION, "PB-ADV Link opened successfully \n\r");
	/* Turn ON Red LED*/
#if LOW_POWER_FEATURE
  /* do nothing */
#else
	BSP_LED_On(LED_RED);
#endif
}

/**
 * @brief  Call back function called when PB-ADV link Closed   
 * @param  none
 * @retval none
 */
void BLEMesh_PbAdvLinkCloseCb(void) {
	TRACE_M(TF_PROVISION, "PB-ADV Link Closed successfully \n\r");
	/* Turn Off Red LED*/
#if LOW_POWER_FEATURE
  /* do nothing */
#else
	BSP_LED_Off(LED_RED);
#endif
}

/**
 * @brief  callback for provision the node by provisioner.
 * @param  void
 * @retval void
 */
void BLEMesh_ProvisionCallback(void) {
	ProvisionFlag = 1;
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  PrvngInProcess = 0;
#endif
	TRACE_I(TF_PROVISION, "Device is provisioned by provisioner \r\n");

#if (LOW_POWER_FEATURE == 1)
  /* Call API LPN_API_TIMER_INTERVAL after LPN provisioning */
//  HW_TS_Start(lowPowerNodeApiTimer_Id, LPN_API_TIMER_INTERVAL);
#endif
}

/**
 * @brief  callback for configuration the node by provisioner.
 * @param  void
 * @retval void
 */
void BLEMesh_ConfigurationCallback(void) {
#if (LOW_POWER_FEATURE == 1)
//  /* Set the task in the scheduler for the next execution */
//  UTIL_SEQ_SetTask( 1<<CFG_TASK_MESH_LPN_REQ_ID, CFG_SCH_PRIO_0);
  /* Call API LPN_API_TIMER_INTERVAL after LPN provisioning */
  if(LPN_scan_enabled == MOBLE_FALSE)
  {
    HW_TS_Start(lowPowerNodeApiTimer_Id, LPN_API_TIMER_INTERVAL);
    LPN_scan_enabled = MOBLE_TRUE;
  }
#endif
}

/**
 * @brief  callback for friendship established by friend node
 * @param  address of corresponding low power node
 * @param  receive delay of low power node (unit ms)
 * @param  poll timeout of low power node (unit 100ms)
 * @param  number of elements of low power node
 * @param  previous friend address of low power node (can be invalid address)
 * @retval void
 */
void BLEMesh_FnFriendshipEstablishedCallback(MOBLE_ADDRESS lpnAddress,
		MOBLEUINT8 lpnReceiveDelay, MOBLEUINT32 lpnPollTimeout,
		MOBLEUINT8 lpnNumElements, MOBLE_ADDRESS lpnPrevFriendAddress) {
	TRACE_M(TF_LPN_FRND,
			"Friendship established. Low power node address 0x%.4X \r\n",
			lpnAddress);
	TRACE_M(TF_LPN_FRND, "Low power node receive delay %dms \r\n",
			lpnReceiveDelay);
	TRACE_M(TF_LPN_FRND, "Low power node poll timeout %ldms \r\n",
			lpnPollTimeout * 100);
	TRACE_M(TF_LPN_FRND, "Low power node number of elements %d \r\n",
			lpnNumElements);
	if (lpnPrevFriendAddress != MOBLE_ADDRESS_UNASSIGNED) {
		TRACE_M(TF_LPN_FRND,
				"Low power node previous friend address 0x%.4X \r\n",
				lpnPrevFriendAddress);
	}
}

/**
 * @brief  callback for friendship clear by friend node
 * @param  reason of friendship clear
 *         0: reserved,
 *         1: friend request received from existing low power node (friend)
 *         2: low power node poll timeout occurred
 *         3: friend clear received
 * @param  previous friend address of low power node (can be invalid address)
 * @retval void
 */
void BLEMesh_FnFriendshipClearedCallback(MOBLEUINT8 reason,
		MOBLE_ADDRESS lpnAddress) {
	TRACE_M(TF_LPN_FRND,
			"Friendship cleared. Low power node address 0x%.4X \r\n",
			lpnAddress);

	switch (reason) {
	case FN_CLEARED_REPEAT_REQUEST:
		TRACE_M(TF_LPN_FRND,
				"Reason: New friend request received from existing low power node \r\n");
		break;
	case FN_CLEARED_POLL_TIMEOUT:
		TRACE_M(TF_LPN_FRND,
				"Reason: Low power node poll timeout occurred \r\n");
		break;
	case FN_CLEARED_FRIEND_CLEAR:
		TRACE_M(TF_LPN_FRND, "Reason: Friend clear received \r\n");
		break;
	default:
		TRACE_M(TF_LPN_FRND, "Reason: Invalid \r\n");
		break;
	}
}

/**
 * @brief  callback for friendship established by low power node
 * @param  address of corresponding friend node
 * @retval void
 */
void BLEMesh_LpnFriendshipEstablishedCallback(MOBLE_ADDRESS fnAddress) {
	/* Friendship established */
	TRACE_M(TF_LPN_FRND, "Friend node responding, friendship established.\r\n");
}

/**
 * @brief  callback for friendship clear by low power node
 * @param  reason of friendship clear.
 *         0: reserved
 *         1: No response received from friend node
 * @retval void
 */
void BLEMesh_LpnFriendshipClearedCallback(MOBLEUINT8 reason,
		MOBLE_ADDRESS fnAddress) {
	TRACE_M(TF_LPN_FRND, "Friendship cleared. Friend node address 0x%.4x \r\n",
			fnAddress);

	if (reason == LPN_CLEARED_NO_RESPONSE) {
		TRACE_M(TF_LPN_FRND, "Reason: Friend node not responding \r\n");
	} else {
		TRACE_M(TF_LPN_FRND, "Reason: Invalid \r\n");
	}
}

/** 
 * @brief  New neighbor appeared callback in neighbor table.
 If MAC address of neighbor changes it appears as new neighbor.
 * @param  MAC address of neighbor.
 *         is neighbor provisioned or unprovisioned device.
 *         uuid of neighbor. NULL if not available
 *         network address of neighbor. MOBLE_ADDRESS_UNASSIGNED if not available
 *         last updated rssi value.
 * @retval void
 */
void BLEMesh_NeighborAppearedCallback(const MOBLEUINT8 *bdAddr,
		MOBLEBOOL provisioned, const MOBLEUINT8 *uuid,
		MOBLE_ADDRESS networkAddress, MOBLEINT8 rssi) {
	TRACE_M(TF_NEIGHBOUR,"New neighbor appeared. Neighbor MAC address:");

	for (MOBLEUINT8 count = 0; count < 6; count++) {
		TRACE_M(TF_NEIGHBOUR,"%.2x ", bdAddr[count]);
	}

