LESA-RPI/LESA_OccupancyUnit/STM32_WPAN/app/appli_mesh.c
	if (provisioned == MOBLE_TRUE) {
		TRACE_M(TF_NEIGHBOUR,"-> Provisioned node. \n\r");
	} else {
		TRACE_M(TF_NEIGHBOUR,"-> Unprovisioned device. \n\r");
	}

	TRACE_M(TF_NEIGHBOUR,"rssi: %d. ", rssi);

	if (networkAddress != MOBLE_ADDRESS_UNASSIGNED) {
		TRACE_M(TF_NEIGHBOUR,"Network address: 0x%.4x\n\r", networkAddress);
	} else {
		TRACE_M(TF_NEIGHBOUR,"Network address not available\n\r");
	}

	for (MOBLEUINT8 i = 0; i < 16; i++) {
		if (uuid[i] == 0x00) {
			continue;
		} else {
			TRACE_M(TF_NEIGHBOUR,"UUID: ");

			for (MOBLEUINT8 count = 0; count < 16; count++) {
				TRACE_M(TF_NEIGHBOUR,"%.2x ", uuid[count]);
			}

			break;
		}
	}

	TRACE_M(TF_NEIGHBOUR,"\n\r");
}

/** 
 * @brief  Existing neighbor refreshed callback in neighbor table.
 If MAC address of neighbor changes it appears as new neighbor.
 * @param  MAC address of neighbor.
 *         is neighbor provisioned or unprovisioned device.
 *         uuid of neighbor. NULL if not available
 *         network address of neighbor. MOBLE_ADDRESS_UNASSIGNED if not available
 *         last updated rssi value.
 * @retval void
 */
void BLEMesh_NeighborRefreshedCallback(const MOBLEUINT8 *bdAddr,
		MOBLEBOOL provisioned, const MOBLEUINT8 *uuid,
		MOBLE_ADDRESS networkAddress, MOBLEINT8 rssi) {
	TRACE_M(TF_NEIGHBOUR,"Existing neighbor refreshed. Neighbor MAC address:");

	for (MOBLEUINT8 count = 0; count < 6; count++) {
		TRACE_M(TF_NEIGHBOUR,"%.2x ", bdAddr[count]);
	}

	if (provisioned == MOBLE_TRUE) {
		TRACE_M(TF_NEIGHBOUR,"-> Provisioned node. \n\r");
	} else {
		TRACE_M(TF_NEIGHBOUR,"-> Unprovisioned device. \n\r");
	}

	TRACE_M(TF_NEIGHBOUR,"rssi: %d. ", rssi);

	if (networkAddress != MOBLE_ADDRESS_UNASSIGNED) {
		TRACE_M(TF_NEIGHBOUR,"Network address: 0x%.4x\n\r", networkAddress);
	} else {
		TRACE_M(TF_NEIGHBOUR,"Network address not available\n\r");
	}

	for (MOBLEUINT8 i = 0; i < 16; i++) {
		if (uuid[i] == 0x00) {
			continue;
		} else {
			TRACE_M(TF_NEIGHBOUR,"UUID: ");

			for (MOBLEUINT8 count = 0; count < 16; count++) {
				TRACE_M(TF_NEIGHBOUR,"%.2x ", uuid[count]);
			}

			break;
		}
	}

	TRACE_M(TF_NEIGHBOUR,"\n\r");
}

/** 
 * @brief  Beacon received callback
 *         Beacons are received only if received beacon ad type is not 
 *         Mesh Message, Mesh Beacon or PB-ADV
 * @param  MAC address
 *         data
 *         length of beacon
 *         rssi value of beacon
 * @retval void
 */
#if (ENABLE_CUSTOM_BEACON == 1)
/* BLEMesh_CustomBeaconReceivedCallback high frequency callback */
void BLEMesh_CustomBeaconReceivedCallback(const MOBLEUINT8* bdAddr,
                                              const MOBLEUINT8* data,
                                              MOBLEUINT8 length,
                                              MOBLEINT8 rssi)
{
  MOBLE_RESULT result = MOBLE_RESULT_SUCCESS;
  
  if (length < 2)
  {
    result = MOBLE_RESULT_FAIL;
    TRACE_M(TF_BEACON, "Message is too small \r\n");
  }
  
  if (result == MOBLE_RESULT_SUCCESS)
  {
    if (data[1] == CUSTOM_BEACON_AD_TYPE)
    {
      TRACE_M(TF_BEACON, "Message length(%d), rssi(%d) \r\n", length, rssi);
  
      if (TF_BEACON == 1)
      {
        TRACE_I(TF_BEACON, "Data: ");
        for (MOBLEUINT8 count=0; count<length; count++)
        {
          TRACE_I(TF_BEACON, "%.2x ", data[count]);
        }
        TRACE_I(TF_BEACON, " \r\n");
      }
    }
  }
}
#endif /* BLEMesh_CustomBeaconReceivedCallback high frequency callback */

/** 
 * @brief  Custom beacon generator
 *         If size set to > 31 bytes, beacon is rejected
 *         BLEMesh_SetCustomBeaconInterval should be set to get this callback
 * @param  beacon data buffer. It includes length and AD type fields
 *         buffer size
 * @retval void
 */
void BLEMesh_CustomBeaconGeneratorCallback(void *buffer, MOBLEUINT8 *size) {
	MOBLEUINT8 adType = CUSTOM_BEACON_AD_TYPE;
	MOBLEUINT8 dataLength = 5;
	MOBLEUINT8 data[5] = { 0x00, 0x01, 0x02, 0x03, 0x04 };
	MOBLEUINT8 *buf = (MOBLEUINT8*) buffer;

	buf[0] = dataLength + 1;
	buf[1] = adType;
	memcpy(buf + 2, data, dataLength);

	*size = dataLength + 2;
}

/**
 * @brief  Low Power mode process 
 *         If low power feature is supported, device enables low power mode
 * @param  void
 * @retval void
 */
void Appli_LowPowerProcess(void) {
#if 0
#if LOW_POWER_FEATURE
  BluenrgMesh_sleepTime = (MOBLEINT32)BluenrgMesh_GetSleepDuration();
  
  if (BluenrgMesh_sleepTime > 0)
  {
    /* Timer 0 used for low power */
    HAL_VTimerStart_ms(0, BluenrgMesh_sleepTime);
    
    /* To start virtual timer */
    BTLE_StackTick();

    /* save virtual timer current count */
    SysRefCount = HAL_VTimerGetCurrentTime_sysT32();
    
    /* wakeup either from io or virtual timer */
    BlueNRG_Sleep(SLEEPMODE_WAKETIMER, WAKEUP_IO13, WAKEUP_IOx_LOW);
    
    /* update systick count based on updated virtual timer count */
    Set_Clock_Time(Clock_Time() + 
                   HAL_VTimerDiff_ms_sysT32(HAL_VTimerGetCurrentTime_sysT32(), SysRefCount));
    
    /* Stop Timer 0 */
    HAL_VTimer_Stop(0);
  }
#endif /* LOW_POWER_FEATURE */
#endif
}

/**
 * @brief  Appli_IntensityControlPublishing:Function is used to set the intensity value.
 *          Publishing the value.
 * @param  void
 * @retval void
 */
void Appli_IntensityControlPublishing(MOBLEUINT8 *value) {

	if (IntensityFlag == FALSE) {

		IntensityValue = IntensityValue + (INTENSITY_LEVEL_FULL / 5);
		value[0] = (MOBLEUINT8) IntensityValue;
		value[1] = (MOBLEUINT8) (IntensityValue >> 8);

		if (IntensityValue >= INTENSITY_LEVEL_FULL) {
			IntensityFlag = TRUE;
		}

	} else {

		IntensityValue = IntensityValue - (INTENSITY_LEVEL_FULL / 5);
		value[0] = (MOBLEUINT8) IntensityValue;
		value[1] = (MOBLEUINT8) (IntensityValue >> 8);

		if (IntensityValue <= INTENSITY_LEVEL_ZERO) {
			IntensityFlag = FALSE;
		}

	}
}

/**
 * @brief  Publish the intensity value for generic level or light lightness 
 *         This function should be called in main loop
 * @param  void
 * @retval void
 */
void IntensityPublish(void) {

