LESA-RPI/LESA_OccupancyUnit/STM32_WPAN/app/appli_mesh.c
#ifdef LIGHT_CLIENT_MODEL_PUBLISH 
#ifdef ENABLE_LIGHT_MODEL_CLIENT_LIGHTNESS  
  MOBLEUINT8 elementIndex = 0; 
  MOBLEUINT8 pLightnessParam[3];
  Appli_IntensityControlPublishing(pLightnessParam);
  Appli_LightClient_API(elementIndex, LIGHT_LIGHTNESS_SET, pLightnessParam); 
#endif
  
#else  
#ifdef GENERIC_CLIENT_MODEL_PUBLISH
  MOBLEUINT8 elementIndex = 0; 
  MOBLEUINT8 pGeneric_LevelParam[3];
  
  Appli_IntensityControlPublishing(pGeneric_LevelParam);
  Appli_GenericClient_API(elementIndex, GENERIC_LEVEL_SET_ACK, pGeneric_LevelParam); 
#endif  
#endif
}

/**
 * @brief  Application processing 
 *         This function should be called in main loop
 * @param  void
 * @retval void
 */
void Appli_Process(void) {
#ifdef ENABLE_SAVE_MODEL_STATE_NVM  
  AppliNvm_Process();
#endif

#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  if(PrvngInProcess)
  {
#if USER_OUTPUT_OOB_APPLI_PROCESS
    Appli_OobAuthenticationProcess();
#endif
  }
#endif

#ifdef TPT_LAYER_BUSY_TEST      
  if(BLEMesh_TrsptIsBusyState())
  {
    //SdkEvalLedOn(LED1);  
  }
  else
  {
    //SdkEvalLedOff(LED1);
  }
#endif      
}

#if PB_ADV_SUPPORTED
static void UnprovisionedDeviceBeaconApp(void) {
	BLEMesh_SetUnprovisionedDevBeaconInterval(0);
}

static void UnprovisionedDeviceBeaconTask(void) {
	/**
	 * The code shall be executed in the background as aci command may be sent
	 * The background is the only place where the application can make sure a new aci command
	 * is not sent if there is a pending one
	 */
	UTIL_SEQ_SetTask(1 << CFG_TASK_MESH_BEACON_REQ_ID, CFG_SCH_PRIO_0);

	return;
}
#endif

#if (APPLI_OPTIM == 1)
static void AppliMeshTask(void)
{
  /* Set the task in the scheduler for the next execution */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_MESH_REQ_ID, CFG_SCH_PRIO_0);

  return;
}
#endif

static void AppliMeshSW1Task(void) {
	Appli_UpdateButtonState(BSP_PB_GetState(BUTTON_SW1) == BUTTON_PRESSED);
	return;
}
static void AppliMeshSW2Task(void) {
	Appli_UpdateButton2State(BSP_PB_GetState(BUTTON_SW2) == BUTTON_PRESSED);
	return;
}
static void TrackingTask(void){
if(BaseFrameValid&&BSP_PB_GetState(COLOR_INT) == BUTTON_PRESSED){
	beginTracking();}
	return;
}

static void LoopTask(void) {
	UTIL_SEQ_SetTask(1 << CFG_TASK_USER_SET_TASK, CFG_SCH_PRIO_0);

	return;
}

static void LoopApp(void)	//TODO: finish up
{
	//colour
	//*
	//printf("\ndt:",*pPropertyId);
	if (Counter == 20) {
		Counter = 0;

		BSP_LED_Toggle(LED_BLUE);
	}
	Counter++;
	//printf("\n\r");
	//TRACE_M(TF_SENSOR,"%d:",Counter++);
	//printf("ID are %d\n\r",*pPropertyId);
	Appli_Sensor_ReadValue_UART();

	//tof
	//*/
}

#if (ENABLE_SENSOR_MODEL_SERVER != 0)
static void AppliMeshSW3Task(void) {
	Sensor_UpdatePublishState(0, 1);

	Appli_Sensor_Update(0, 1);

	return;
}
#endif

#if (LOW_POWER_FEATURE == 1)
static void LowPowerNodeApiApp(void)
{
  TRACE_I(TF_PROVISION,"Scan disabled \r\n");
  BLEMesh_LpnDisableScan();
    
  return;
}

static void LowPowerNodeApiTask(void)
{
  /* Set the task in the scheduler for the next execution */
  UTIL_SEQ_SetTask( 1<<CFG_TASK_MESH_LPN_REQ_ID, CFG_SCH_PRIO_0);
  
  return;
}
#endif

#ifdef SAVE_MODEL_STATE_POWER_FAILURE_DETECTION       
/**
* @brief function to inintiallise the GPIO interrupt for Power down 
* @param  void
* @retval void
*/
static void GPIO_InitNVICPowerOff(void)
{
  GPIO_InitTypeDef gpioinitstruct = {0};
  
  /* Enable the PowerOff GPIO Clock */
  POWEROFF_GPIO_CLK_ENABLE();
  
  /* Configure PowerOff pin as input with External interrupt */
  gpioinitstruct.Pin  = POWEROFF_PIN;
  gpioinitstruct.Pull = GPIO_PULLUP;
  gpioinitstruct.Mode = GPIO_MODE_IT_FALLING; 
  HAL_GPIO_Init(POWEROFF_GPIO_PORT, &gpioinitstruct);
  
  /* Enable and set PowerOff EXTI Interrupt to the lowest priority */
  HAL_NVIC_SetPriority((IRQn_Type)(POWEROFF_EXTI_IRQn), 0x0F, 0x00);
  HAL_NVIC_EnableIRQ((IRQn_Type)(POWEROFF_EXTI_IRQn));
}
#endif

/**
 * @brief  Initializes the Application  
 * @param  void
 * @retval void
 */
void Appli_Init(MOBLEUINT8 *flag) //TODO: add task seq
{
#if 0
#ifdef ENABLE_UNPROVISIONING_BY_POWER_ONOFF_CYCLE  
/* Hardware Factory Restore implementation */
  AppliNvm_FactorySettingReset();
#endif
#endif

#if PB_ADV_SUPPORTED
	UTIL_SEQ_RegTask(1 << CFG_TASK_MESH_BEACON_REQ_ID, UTIL_SEQ_RFU,
			UnprovisionedDeviceBeaconApp);
	/**
	 * Create Timer to control unprovisioned device beacons
	 */
	HW_TS_Create(CFG_TIM_PROC_ID_ISR, &discoverTimer_Id, hw_ts_SingleShot,
			UnprovisionedDeviceBeaconTask);
	HW_TS_Start(discoverTimer_Id, DISCOVER_TIMER_INTERVAL);
	/*
	 * Create Timer to control interrupt//TODO
	 * */
	UTIL_SEQ_RegTask(1 << CFG_TASK_USER_SET_TASK, UTIL_SEQ_RFU, LoopApp);

	HW_TS_Create(CFG_TIM_PROC_ID_ISR, &discoverTimer_Id2, hw_ts_Repeated,
			LoopTask);

	//HW_TS_Start(discoverTimer_Id2, LOOP_TIME_INTERVAL);

#endif

#if ENABLE_SERIAL_INTERFACE
	Serial_Init();
#endif

#ifdef SAVE_MODEL_STATE_POWER_FAILURE_DETECTION       
  GPIO_InitNVICPowerOff();
#endif 

#if 0
#if (( CFG_LPM_SUPPORTED == 0) && (ENABLE_PWM_SUPPORT == 1))
  __HAL_RCC_TIM1_CLK_ENABLE();
  __HAL_RCC_TIM2_CLK_ENABLE();
  PWM_Init();
#ifdef USER_BOARD_1LED
  Modify_PWM(SINGLE_LED, 1);     
#endif
#ifdef  USER_BOARD_COOL_WHITE_LED
  Modify_PWM(COOL_LED, 0); 
  Modify_PWM(WARM_LED, 0); 
#endif
#ifdef  USER_BOARD_RGB_LED
  Modify_PWM(RED_LED, 1); 
  Modify_PWM(GREEN_LED, 1); 
  Modify_PWM(BLUE_LED, 1);
#endif
#endif
#endif

	UTIL_SEQ_RegTask(1 << CFG_TASK_MESH_SW1_REQ_ID, UTIL_SEQ_RFU,
			AppliMeshSW1Task);
	UTIL_SEQ_RegTask(1 << CFG_TASK_MESH_SW2_REQ_ID, UTIL_SEQ_RFU,
			AppliMeshSW2Task);
	UTIL_SEQ_RegTask(1 << CFG_TASK_MESH_COLOR_REQ_ID, UTIL_SEQ_RFU,
			TrackingTask);


#if (ENABLE_CUSTOM_BEACON == 1)
  BLEMesh_SetCustomBeaconInterval(CUSTOM_BEACON_INTERVAL);
#endif

#if (LOW_POWER_FEATURE == 1)  /**
  * Create Timer to control unprovisioned device beacons
  */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &lowPowerNodeApiTimer_Id, hw_ts_SingleShot, LowPowerNodeApiTask);
  
  UTIL_SEQ_RegTask( 1<< CFG_TASK_MESH_LPN_REQ_ID, UTIL_SEQ_RFU, LowPowerNodeApiApp );
  LPN_scan_enabled = MOBLE_FALSE;
#endif
#if (ENABLE_SENSOR_MODEL_SERVER != 0)
	UTIL_SEQ_RegTask(1 << CFG_TASK_MESH_SW3_REQ_ID, UTIL_SEQ_RFU,
			AppliMeshSW3Task);
#endif

